Revit 2024 API
PathOfTravelCalculationStatus Enumeration
 An enumerated type containing possible results of the Path of Travel calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Since: 2020
Syntax
C#
public enum PathOfTravelCalculationStatus
Visual Basic
Public Enumeration PathOfTravelCalculationStatus
Visual C++
public enum class PathOfTravelCalculationStatus
Members
Member name | Description
Success |  A valid path of travel between the two points was found. Use [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] to retrieve the calculated points of path of travel.
NoPathOfTravel |  There is no valid path between the two points.
AreaTooLarge |  The view outline is too large. Calculation of the path of travel cannot be performed.
SplitView |  The view is split. Calculation of the path of travel cannot be performed.
ResultAffectedByCrop |  The view has an active crop region set. If [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] contains no points, no path of travel was found inside the crop region, but a valid path may exist outside of it. If [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] contains valid points, a path of travel was found inside the crop region, but a better option may exist outside of it.
StartAndEndPointsTooClose |  Distance between adjacent points of path of travel (start, end and way points) is less than the value of [!:Autodesk::Revit::DB::Analysis::RouteAnalysisSettings::MinimumLength].
PointOutsideActiveCrop |  Start or end point is outside the active view crop.
TooMuchGeometry |  The view is exporting too much geometry. Calculation of the path of travel cannot be performed.
RevealObstaclesModeFailureDataExist |  Reveal Obstacles mode cannot be set for the view because analysis data exist in the view.
RevealObstaclesModeFailureWireframe |  Reveal Obstacles mode cannot be set for the view because wireframe display style is set for the view.
TemporaryModeFailureDataExist |  Temporary mode cannot be set for the view because analysis data exist in the view.
TemporaryModeFailureWireframe |  Temporary mode cannot be set for the view because wireframe display style is set for the view.
See Also
Autodesk.Revit.DB.Analysis Namespace